{
  "diseases": [
    {
      "name": "Diabetes",
      "description": "Diabetes is a chronic condition that affects how your body turns food into energy. Symptoms include increased thirst, frequent urination, extreme hunger, fatigue, and blurred vision. Causes include genetics, obesity, and lack of physical activity. Complications may involve heart disease, kidney damage, and nerve damage. Prevention includes maintaining a healthy weight, exercising regularly, and eating a balanced diet.",
      "treatment": "Type 1: Requires insulin. Type 2: Managed with diet, medication, and lifestyle changes."
    },
    {
      "name": "Influenza",
      "description": "Influenza (flu) is a contagious respiratory illness caused by influenza viruses. Symptoms include fever, cough, sore throat, body aches, fatigue, and runny nose. Causes include influenza virus types A, B, and C. Complications may involve pneumonia, sinus infections, and worsening of chronic conditions. Prevention includes getting a flu vaccine annually, washing hands regularly, and avoiding close contact with sick people.",
      "treatment": "Treatment includes antiviral medications, rest, and fluids."
    },
    {
      "name": "Abdominal Hernia",
      "description": "An abdominal hernia occurs when an organ pushes through an opening in the muscle. Symptoms include a visible bulge, pain in the abdomen, nausea, and discomfort when lifting objects. Causes include weak muscles, heavy lifting, and obesity. Complications may involve bowel obstruction and strangulation (loss of blood supply). Prevention includes avoiding heavy lifting, maintaining a healthy weight, and strengthening abdominal muscles.",
      "treatment": "Mild cases may not need treatment, but severe cases require surgery."
    },
    {
      "name": "Deep Vein Thrombosis",
      "description": "DVT occurs when a blood clot forms in a deep vein, usually in the legs. Symptoms include leg swelling, pain, red or discolored skin, and warmth in the affected leg. Causes include prolonged immobility, surgery, and genetic clotting disorders. Complications may involve pulmonary embolism (clot traveling to the lungs). Prevention includes staying active, avoiding sitting for long periods, and wearing compression stockings if needed.",
      "treatment": "Treatment includes blood thinners and compression stockings."
    },
    {
      "name": "Crohn's Disease",
      "description": "Crohn's disease is a chronic inflammatory bowel disease that affects the digestive tract. Symptoms include diarrhea, abdominal pain, weight loss, fatigue, and blood in stool. Causes include immune system dysfunction, genetics, and environmental factors. Complications may involve malnutrition, intestinal blockages, and colon cancer. Prevention includes eating a balanced diet, avoiding smoking, and managing stress levels.",
      "treatment": "Managed with anti-inflammatory drugs, dietary changes, and sometimes surgery."
    },
    {
      "name": "Sepsis",
      "description": "Sepsis is a life-threatening condition caused by the body's response to an infection. Symptoms include fever, confusion, rapid breathing, low blood pressure, and chills. Causes include bacterial infections, severe burns, and a weakened immune system. Complications may involve organ failure and septic shock. Prevention includes getting vaccinated, practicing good hygiene, and seeking prompt treatment for infections.",
      "treatment": "Requires immediate medical attention, including antibiotics, IV fluids, and oxygen therapy."
    },
    {
      "name": "Conjunctivitis",
      "description": "Conjunctivitis, or pink eye, is an inflammation of the conjunctiva. Symptoms include red eyes, itchiness, watery discharge, swelling, and light sensitivity. Causes include viral infections, bacterial infections, and allergies. Complications may involve corneal inflammation and vision problems if untreated. Prevention includes avoiding touching eyes, washing hands frequently, and not sharing personal items.",
      "treatment": "Treatment depends on the cause: bacterial cases require antibiotic eye drops, while allergic conjunctivitis is managed with antihistamines."
    },
    {
      "name": "Epilepsy",
      "description": "Epilepsy is a neurological disorder marked by recurrent, unprovoked seizures. Symptoms include seizures, confusion, uncontrollable jerking movements, and staring spells. Causes include genetic factors, brain injuries, and strokes. Complications may involve injury during seizures, depression, and memory problems. Prevention includes avoiding head injuries, managing risk factors like high blood pressure, and following treatment plans.",
      "treatment": "Managed with anti-seizure medications and lifestyle adjustments."
    }
  ]
}
